<?php

return [

    /*
    |--------------------------------------------------------------------------
    | ezPay 電子發票 API 環境設定
    |--------------------------------------------------------------------------
    |
    | 設定 ezPay 電子發票平台 API 的運行環境，需注意不同環境的
    | 商店代號與金鑰是不共用的：
    |
    | - test: 測試環境
    | - production: 正式環境
    |
    */

    'env' => env('EZPAY_INVOICE_ENV', 'test'),

    /*
    |--------------------------------------------------------------------------
    | ezPay 電子發票 API 商店代號與金鑰
    |--------------------------------------------------------------------------
    |
    | 設定您的 ezPay 電子發票平台的商店基本資訊，包含商店代號、加密金鑰等。
    | 用於電子發票 API 和手機條碼與捐證碼驗證 API。
    |
    */

    'merchant_id' => env('EZPAY_INVOICE_MERCHANT_ID', ''),

    'merchant_hash_key' => env('EZPAY_INVOICE_MERCHANT_HASH_KEY', ''),

    'merchant_hash_iv' => env('EZPAY_INVOICE_MERCHANT_HASH_IV', ''),

    /*
    |--------------------------------------------------------------------------
    | ezPay 電子發票 API 帳號代號和金鑰
    |--------------------------------------------------------------------------
    |
    | 設定您的 ezPay 電子發票平台的帳號基本資訊，包含帳號代號、加密金鑰等。
    | 用於字軌管理 API。
    |
    */

    'company_id' => env('EZPAY_INVOICE_COMPANY_ID', ''),

    'company_hash_key' => env('EZPAY_INVOICE_COMPANY_HASH_KEY', ''),

    'company_hash_iv' => env('EZPAY_INVOICE_COMPANY_HASH_IV', ''),

    /*
    |--------------------------------------------------------------------------
    | ezPay 電子發票 API 連線逾時設定
    |--------------------------------------------------------------------------
    |
    | 設定與 ezPay 電子發票平台 API 連線的逾時秒數。
    |
    */

    'timeout' => (int) env('EZPAY_INVOICE_TIMEOUT', 30),

];
